InformationRegisters/__СостояниеСеансовВебСервиса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>__СостояниеСеансовВебСервиса</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ГруппаПользователей</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыПользователей</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Компьютер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Компьютеры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РежимРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РежимыРаботы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ресторан</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Рестораны</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Восстановление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/__СостояниеСеансовВебСервиса/Ext/RecordSetModule.bsl
Процедура ПередЗаписью(Отказ, Замещение)
	
	// При обмене данными ничего не проверяем.
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ТекущаяДата = ТекущаяДата();
	
	// Заполнение реквизитов.
	Для Каждого Запись Из ЭтотОбъект Цикл
		
		Если Не ЗначениеЗаполнено(Запись.ГруппаПользователей) Тогда
			Запись.ГруппаПользователей = ПараметрыСеанса.ТекущаяГруппаПользователей;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Запись.Компьютер) Тогда
			Запись.Компьютер = ПараметрыСеанса.ТекущийКомпьютер;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Запись.Пользователь) Тогда
			Запись.Пользователь = ПараметрыСеанса.ТекущийПользователь;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Запись.РежимРаботы) Тогда
			Запись.РежимРаботы = ПараметрыСеанса.ТекущийРежимРаботы;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Запись.Сотрудник) Тогда
			Запись.Сотрудник = ПараметрыСеанса.ТекущийСотрудник;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Запись.ДатаНачалаПериода) Тогда
			Запись.ДатаНачалаПериода = ТекущаяДата;
		КонецЕсли;
		Запись.ДатаОкончанияПериода = Макс(Запись.ДатаОкончанияПериода, ТекущаяДата);
		
	КонецЦикла;
	
КонецПроцедуры // ПередЗаписью()
